[
  {
    "title": { "es": "Carta Afiliación", "en": "Affiliation Letter" },
    "description": {
      "es": "Módulo web para consultar afiliados y generar la carta de afiliación a partir de datos de identificación.",
      "en": "Web module to look up members and generate an affiliation letter from identification data."
    },
    "tech": ["Next.js", "React", "Tailwind", "API", "SQL Server"],
    "link": "https://cartaafiliacion.arssenasa.gob.do/",
    "image": "/projects/carta-afiliacion.webp",
    "gallery": []
  },
  {
    "title": { "es": "Watch.MV", "en": "Watch.MV" },
    "description": {
      "es": "Plataforma web de streaming desarrollada como proyecto final grupal del ITLA. Incluye autenticación, catálogo visual de películas y diseño inspirado en servicios de streaming modernos.",
      "en": "Streaming web platform built as an ITLA group final project. Includes authentication, a visual movie catalog, and a design inspired by modern streaming services."
    },
    "tech": ["HTML", "CSS", "JavaScript", "React", "UI/UX"],
    "link": "https://watch-mv.netlify.app/",
    "image": "/projects/watch-mv.webp",
    "gallery": []
  },
  {
    "title": { "es": "App Móvil MINERD", "en": "MINERD Mobile App" },
    "description": {
      "es": "Aplicación móvil desarrollada en Flutter para el Ministerio de Educación (MINERD). Permite registrar y consultar visitas, gestionar incidencias, visualizar mapas, consultar centros educativos y directores, además de módulos informativos como noticias, clima y seguridad.",
      "en": "Flutter mobile app for the Ministry of Education (MINERD). It supports visit tracking, incident management, maps, school and director lookup, plus informational modules like news, weather, and safety."
    },
    "tech": ["Flutter", "Dart", "API REST", "UI/UX", "Mobile"],
    "link": "",
    "image": "/projects/minerd-app.webp",
    "gallery": []
  },
  {
    "title": { "es": "App Móvil Uncharted 4", "en": "Uncharted 4 Mobile App" },
    "description": {
      "es": "Aplicación móvil informativa desarrollada en Flutter inspirada en el videojuego Uncharted 4. Incluye secciones de historia, personajes y diseño visual enfocado en experiencia de usuario.",
      "en": "Flutter informational mobile app inspired by Uncharted 4. Includes story and characters sections, with a visual design focused on user experience."
    },
    "tech": ["Flutter", "Dart", "UI/UX", "Mobile"],
    "link": "",
    "image": "/projects/uncharted4/2.webp",
    "gallery": [
      "/projects/uncharted4/1.webp",
      "/projects/uncharted4/3.webp",
      "/projects/uncharted4/4.webp"
    ]
  }
]